In [1]:
import pandas as pd
import numpy as np

In [2]:
all_unemployment_regions_df = pd.read_csv('unemployment.csv')
all_unemployment_regions_df.head()

,Unnamed: 0,series_id,year,period,value,footnote_codes,region
0,0,LASST050000000000003,1976,M01,7.4,,Arkansas
1,1,LASST050000000000003,1976,M02,7.4,,Arkansas
2,2,LASST050000000000003,1976,M03,7.4,,Arkansas
3,3,LASST050000000000003,1976,M04,7.3,,Arkansas
4,4,LASST050000000000003,1976,M05,7.2,,Arkansas

In [6]:
all_fuels_region_production = pd.read_csv('fuel_region_production.csv')
all_fuels_region_production.head()

   Unnamed: 0    date  energy_production fuel_type  region
0           0  201812           64.28964      Coal  Alaska
1           1  201811           82.86349      Coal  Alaska
2           2  201810                NaN      Coal  Alaska
3           3  201809           78.22302      Coal  Alaska
4           4  201808           65.52859      Coal  Alaska

In [14]:
region_counts = all_unemployment_regions_df['region'].value_counts()

In [16]:
unemployment_regions = [ unemployment_region for unemployment_region in region_counts.index]

In [25]:
fuel_regions = all_fuels_region_production['region'].value_counts().index
fuel_regions = [ fuel_region.replace(' ', '') for fuel_region in fuel_regions]
fuel_regions

['UnitedStates',
 'California',
 'PacificContiguous(total)',
 'Mountain(total)',
 'SouthAtlantic(total)',
 'MiddleAtlantic(total)',
 'Pennsylvania',
 'EastNorthCentral(total)',
 'WestSouthCentral(total)',
 'WestNorthCentral(total)',
 'EastSouthCentral(total)',
 'Michigan',
 'Texas',
 'Washington',
 'NewYork',
 'NewEngland(total)',
 'Tennessee',
 'Ohio',
 'Illinois',
 'Florida',
 'NewJersey',
 'Arizona',
 'Missouri',
 'PacificNoncontiguous(total)',
 'Massachusetts',
 'SouthCarolina',
 'NorthCarolina',
 'Minnesota',
 'Georgia',
 'Colorado',
 'Wisconsin',
 'Oklahoma',
 'Connecticut',
 'Arkansas',
 'Louisiana',
 'Maryland',
 'Virginia',
 'Iowa',
 'Hawaii',
 'Indiana',
 'Nevada',
 'Utah',
 'Oregon',
 'Alabama',
 'NewHampshire',
 'Kentucky',
 'WestVirginia',
 'Montana',
 'Nebraska',
 'Maine',
 'Idaho',
 'Kansas',
 'Mississippi',
 'NorthDakota',
 'NewMexico',
 'Vermont',
 'Alaska',
 'Delaware',
 'Wyoming',
 'SouthDakota',
 'RhodeIsland',
 'DistrictOfColumbia']

In [26]:
joined_regions = [ unemployment_region for unemployment_region in unemployment_regions \
                  if unemployment_region in fuel_regions]

In [27]:
[ region for region in region_counts.index if region not in joined_regions]

['PuertoRico', 'DC']

In [28]:
all_fuels_region_production['region'].value_counts().index

Index(['United States', 'California', 'Pacific Contiguous (total)',
       'Mountain (total)', 'South Atlantic (total)', 'Middle Atlantic (total)',
       'Pennsylvania', 'East North Central (total)',
       'West South Central (total)', 'West North Central (total)',
       'East South Central (total)', 'Michigan', 'Texas', 'Washington',
       'New York', 'New England (total)', 'Tennessee', 'Ohio', 'Illinois',
       'Florida', 'New Jersey', 'Arizona', 'Missouri',
       'Pacific Noncontiguous (total)', 'Massachusetts', 'South Carolina',
       'North Carolina', 'Minnesota', 'Georgia', 'Colorado', 'Wisconsin',
       'Oklahoma', 'Connecticut', 'Arkansas', 'Louisiana', 'Maryland',
       'Virginia', 'Iowa', 'Hawaii', 'Indiana', 'Nevada', 'Utah', 'Oregon',
       'Alabama', 'New Hampshire', 'Kentucky', 'West Virginia', 'Montana',
       'Nebraska', 'Maine', 'Idaho', 'Kansas', 'Mississippi', 'North Dakota',
       'New Mexico', 'Vermont', 'Alaska', 'Delaware', 'Wyoming',
       'South Dakota', 'Rhode Island', 'District Of Columbia'],
      dtype='object')

In [ ]:
# All states represented, need to join the fuel regions to match format and replace `District of Columbia` with DC